BIRTHDAY_DATE_FORMAT = '%Y-%m-%d'
FULL_DATE_FORMAT = '%Y-%m-%d %H:%M:%S'
TASK_INTERVAL_MINUTES = 1

START_MESSAGE = '''
Приветствую, для полноценного пользования сервисом потребуется авторизация, не забудьте её пройти.
Чтобы узнавать о днях рождениях коллег - подпишитесь на них. 
'''

CANCEL_MESSAGE = '''
Отменено.
'''

REQUEST_NAME_MESSAGE_INVALID = '''
"Таких коротких фамилий не бывает, введите другую"
'''

SUBSCRIBE_OFFER = '''
Прекрасно, теперь на вас могут подписываться и поздравлять\n
Нажмите или выберите "Подписаться", чтобы быть в курсе дней рождений других
'''
