BIRTHDAY_DATE_FORMAT = '%Y-%m-%d'
FULL_DATE_FORMAT = '%Y-%m-%d %H:%M:%S'
TASK_INTERVAL_MINUTES = 1

START_MESSAGE = '''
Приветствую, для полноценного пользования сервисом потребуется авторизация, не забудьте её пройти.
Чтобы узнавать о днях рождениях коллег - подпишитесь на них. 
'''

CANCEL_MESSAGE = '''
Отменено.
'''

YOU_ALREADY_AUTH_MESSAGE = '''
Вы уже авторизованы
'''

AUTH_DATE_MESSAGE = '''
Отлично, теперь введите дату вашего рождения, в формате\n1985-09-14
'''


REQUEST_NAME_MESSAGE = '''
"Отлично, теперь введите ваше имя"
'''

REQUEST_NAME_MESSAGE_INVALID = '''
"Таких коротких фамилий не бывает, введите другую"
'''

SUBSCRIBE_OFFER = '''
Прекрасно, теперь на вас могут подписываться и поздравлять\n
Нажмите или выберите "Подписаться", чтобы быть в курсе дней рождений других
'''
