BIRTHDAY_DATE_FORMAT = '%Y-%m-%d'
FULL_DATE_FORMAT = '%Y-%m-%d %H:%M:%S'
TASK_INTERVAL_MINUTES = 1

START_MESSAGE = '''
Приветствую, для полноценного пользования сервисом потребуется авторизация, не забудьте её пройти.
Чтобы узнавать о днях рождениях коллег - подпишитесь на них. 
'''

CANCEL_MESSAGE = '''
Отменено.
'''

YOU_UNSUBSCRIBED_MESSAGE = '''
Вы отписались от рассылки
'''

YOU_ALREADY_AUTH_MESSAGE = '''
Вы уже авторизованы
'''

ENTER_SURNAME_MESSAGE = '''
Введите свою фамилию
'''

SURNAME_INVALID_MESSAGE = '''
"Таких коротких фамилий не бывает, введите другую"
'''

ENTER_NAME_MESSAGE = '''
"Отлично, теперь введите ваше имя"
'''

NAME_INVALID_MESSAGE = '''
Таких коротких имён не бывает, введите другое
'''

ENTER_OTCHESTVO_MESSAGE = '''
Отлично, теперь введите ваше отчество
'''

OTCHESTVO_INVALID_MESSAGE = '''
Таких коротких отчеств не бывает, введите другое
'''

ENTER_BIRTHDAY_MESSAGE = '''
Отлично, теперь введите дату вашего рождения, в формате\n1985-09-14
'''

BIRTHDAY_INVALID_MESSAGE = '''
Дата введена неверно, пожалуйста перепроверьте
'''

CHECK_ENTERED_INFO_MESSAGE = '''
Отлично, проверьте корректность введённой информации:
'''

SUBSCRIBE_OFFER = '''
Прекрасно, теперь на вас могут подписываться и поздравлять\nНажмите или выберите "Подписаться", чтобы быть в курсе дней рождений других
'''

REPEAT_AUTHORIZATION_MESSAGE = '''
Тогда попробуем ещё раз ввести данные.\nВведите свою фамилию
'''

CHOSE_SUBSCRIBE_TYPE_MESSAGE = '''
Выберите тип подписки
'''

PLEASE_AUTH_MESSAGE = '''
Пройдите авторизацию
'''